app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT * FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("endereco", "created_at", "nome", "cep", "updated_at", "data_nascimento", "bairro", "cidade", "numero", "estado", "sexo", "email") VALUES('Tv. Djalma dutra, 277', '2010-12-14 04:35:48', 'Bruno Melo', 66113010, '2010-12-14 04:35:48', '1985-08-16', 'Telégrafo', 'Belém', '277', 'PA', 'Masculino', 'bruno@cooletivo.com.br')