app/controllers/cupoms_controller.rb

 def create
	@cupom = Cupom.new(params[:cupom])
	if @cupom.save
---
INSERT INTO "cupoms" ("forma_de_pagamento", "created_at", "id_cliente", "id_fonecedor", "valor_de_compra", "updated_at", "validade", "valor_de_credito") VALUES(NULL, '2010-12-13 17:11:45', NULL, NULL, NULL, '2010-12-13 17:11:45', NULL, NULL)

 def edit
   @cupom = Cupom.find(params[:id])
---
SELECT * FROM "cupoms" WHERE ("cupoms"."id" = 7)

 def update
  @cupom = Cupom.find(params[:id])
  if @cupom.update_attributes(params[:cupom])
---
SELECT * FROM "cupoms" WHERE ("cupoms"."id" = 7)
UPDATE "cupoms" SET "updated_at" = '2010-12-14 17:33:03', "forma_de_pagamento" = 'pagseguro', "id_fonecedor" = 23, "id_cliente" = 44, "valor_de_credito" = 345, "valor_de_compra" = 44, "validade" = '2010-12-14' WHERE "id" = 1

 def show
	@cupom = Cupom.find(params[:id])
---
SELECT * FROM "cupoms" WHERE ("cupoms"."id" = -610707478)

 def index
	@cupom = Cupom.all
---
SELECT * FROM "cupoms"