app/controllers/fornecedores_controller.rb

SELECT * FROM "fornecedores"
---
  def index
    @fornecedores = Fornecedore.all

SELECT * FROM "fornecedores" WHERE ("fornecedores"."id" = 1)
---
  def show
    @fornecedore = Fornecedore.find(params[:id])

SELECT * FROM "fornecedores" WHERE ("fornecedores"."id" = 1)
---
  def edit
    @fornecedore = Fornecedore.find(params[:id])

INSERT INTO "fornecedores" ("endereco", "telefone", "created_at", "responsavel", "contato_financeiro", "updated_at", "cnpj", "incricao_estadual", "contato1", "razao_social", "contato2", "contato3", "nome_fantasia", "email") VALUES('tv djalma dutra, 277
---
  def create
    @fornecedore = Fornecedore.new(params[:fornecedore])

    respond_to do |format|
      if @fornecedore.save